7767517
57 65
Input                    input0                   0 1 input0 0=224 1=224 2=3 -23329=1,127.779907
Convolution              Conv_0                   1 1 input0 192 0=64 1=7 3=2 4=3 5=1 6=9408 20=1 21=82 22=15 24=2 25=1 -23329=1,102.816269
ReLU                     Relu_1                   1 1 192 125 20=1 21=32767 22=15 23=1 -23329=1,102.816269
Pooling                  MaxPool_2                1 1 125 126 1=3 2=2 3=1 5=1 20=1 21=30826 22=15 -23329=1,96.725990
Split                    splitncnn_0              1 2 126 126_splitncnn_0 126_splitncnn_1 -23329=1,96.725990
Convolution              Conv_3                   1 1 126_splitncnn_1 195 0=64 1=3 4=1 5=1 6=36864 20=1 21=73 22=15 24=2 25=1 26=18077 27=14 -23329=1,72.987724
ReLU                     Relu_4                   1 1 195 129 20=1 21=19304 22=13 23=1 -23329=1,171.992294
Convolution              Conv_5                   1 1 129 198 0=64 1=3 4=1 5=1 6=36864 20=1 21=78 22=15 24=2 25=1 26=25298 27=14 -23329=1,67.398621
Eltwise                  Add_6                    2 1 198 126_splitncnn_0 132 0=1 20=1 21=18317 22=15 17=23513 18=14 -23329=1,54.071911
ReLU                     Relu_7                   1 1 132 133 20=1 21=32546 22=15 23=1 -23329=1,53.706844
Split                    splitncnn_1              1 2 133 133_splitncnn_0 133_splitncnn_1 -23329=1,53.706844
Convolution              Conv_8                   1 1 133_splitncnn_1 201 0=64 1=3 4=1 5=1 6=36864 20=1 21=112 22=15 24=2 25=1 -23329=1,83.317841
ReLU                     Relu_9                   1 1 201 136 20=1 21=19557 22=14 23=1 -23329=1,99.454391
Convolution              Conv_10                  1 1 136 204 0=64 1=3 4=1 5=1 6=36864 20=1 21=147 22=15 24=2 25=1 -23329=1,54.141407
Eltwise                  Add_11                   2 1 204 133_splitncnn_0 139 0=1 20=1 21=24053 22=15 17=16517 18=14 16=1 -23329=1,39.743134
ReLU                     Relu_12                  1 1 139 140 20=1 21=32767 22=15 23=1 -23329=1,39.743134
Split                    splitncnn_2              1 2 140 140_splitncnn_0 140_splitncnn_1 -23329=1,39.743134
Convolution              Conv_13                  1 1 140_splitncnn_1 207 0=128 1=3 3=2 4=1 5=1 6=73728 20=1 21=111 22=15 24=2 25=1 -23329=1,80.215553
ReLU                     Relu_14                  1 1 207 143 20=1 21=23214 22=14 23=1 -23329=1,113.655739
Convolution              Conv_15                  1 1 143 210 0=128 1=3 4=1 5=1 6=147456 20=1 21=116 22=15 24=2 25=1 -23329=1,70.329300
Convolution              Conv_16                  1 1 140_splitncnn_0 213 0=128 1=1 3=2 5=1 6=8192 20=1 21=400 22=15 24=2 25=1 -23329=1,89.084488
Eltwise                  Add_17                   2 1 210 213 148 0=1 20=1 21=20668 22=15 17=20753 18=14 -23329=1,56.191437
ReLU                     Relu_18                  1 1 148 149 20=1 21=17147 22=14 23=1 -23329=1,58.807388
Split                    splitncnn_3              1 2 149 149_splitncnn_0 149_splitncnn_1 -23329=1,58.807388
Convolution              Conv_19                  1 1 149_splitncnn_1 216 0=128 1=3 4=1 5=1 6=147456 20=1 21=110 22=15 24=2 25=1 -23329=1,80.791443
ReLU                     Relu_20                  1 1 216 152 20=1 21=20739 22=14 23=1 -23329=1,102.264969
Convolution              Conv_21                  1 1 152 219 0=128 1=3 4=1 5=1 6=147456 20=1 21=125 22=15 24=2 25=1 -23329=1,56.408699
Eltwise                  Add_22                   2 1 219 149_splitncnn_0 155 0=1 20=1 21=30511 22=15 17=17081 18=14 -23329=1,54.758205
ReLU                     Relu_23                  1 1 155 156 20=1 21=25369 22=15 23=1 -23329=1,42.394909
Split                    splitncnn_4              1 2 156 156_splitncnn_0 156_splitncnn_1 -23329=1,42.394909
Convolution              Conv_24                  1 1 156_splitncnn_1 222 0=256 1=3 3=2 4=1 5=1 6=294912 20=1 21=122 22=15 24=2 25=1 -23329=1,84.704514
ReLU                     Relu_25                  1 1 222 159 20=1 21=17695 22=14 23=1 -23329=1,91.480873
Convolution              Conv_26                  1 1 159 225 0=256 1=3 4=1 5=1 6=589824 20=1 21=94 22=15 24=2 25=1 -23329=1,58.853855
Convolution              Conv_27                  1 1 156_splitncnn_0 228 0=256 1=1 3=2 5=1 6=32768 20=1 21=350 22=15 24=2 25=1 -23329=1,140.883911
Eltwise                  Add_28                   2 1 225 228 164 0=1 20=1 21=14305 22=15 17=19610 18=13 -23329=1,61.504673
ReLU                     Relu_29                  1 1 164 165 20=1 21=18790 22=14 23=1 -23329=1,70.538094
Split                    splitncnn_5              1 2 165 165_splitncnn_0 165_splitncnn_1 -23329=1,70.538094
Convolution              Conv_30                  1 1 165_splitncnn_1 231 0=256 1=3 4=1 5=1 6=589824 20=1 21=77 22=15 24=2 25=1 -23329=1,76.910484
ReLU                     Relu_31                  1 1 231 168 20=1 21=19790 22=14 23=1 -23329=1,92.898170
Convolution              Conv_32                  1 1 168 234 0=256 1=3 4=1 5=1 6=589824 20=1 21=116 22=15 24=2 25=1 -23329=1,43.095066
Eltwise                  Add_33                   2 1 234 165_splitncnn_0 171 0=1 20=1 21=19787 22=15 17=26817 18=14 -23329=1,42.595558
ReLU                     Relu_34                  1 1 171 172 20=1 21=21569 22=14 23=1 -23329=1,56.076321
Split                    splitncnn_6              1 2 172 172_splitncnn_0 172_splitncnn_1 -23329=1,56.076321
Convolution              Conv_35                  1 1 172_splitncnn_1 237 0=512 1=3 3=2 4=1 5=1 6=1179648 20=1 21=98 22=15 24=2 25=1 -23329=1,70.754929
ReLU                     Relu_36                  1 1 237 175 20=1 21=23325 22=14 23=1 -23329=1,100.728828
Convolution              Conv_37                  1 1 175 240 0=512 1=3 4=1 5=1 6=2359296 20=1 21=110 22=15 24=2 25=1 -23329=1,37.616817
Convolution              Conv_38                  1 1 172_splitncnn_0 243 0=512 1=1 3=2 5=1 6=131072 20=1 21=499 22=15 24=2 25=1 -23329=1,108.711510
Eltwise                  Add_39                   2 1 240 243 180 0=1 20=1 21=9464 22=15 17=23675 18=13 -23329=1,31.397888
ReLU                     Relu_40                  1 1 180 181 20=1 21=23172 22=14 23=1 -23329=1,44.406139
Split                    splitncnn_7              1 2 181 181_splitncnn_0 181_splitncnn_1 -23329=1,44.406139
Convolution              Conv_41                  1 1 181_splitncnn_1 246 0=512 1=3 4=1 5=1 6=2359296 20=1 21=83 22=15 24=2 25=1 -23329=1,48.796951
ReLU                     Relu_42                  1 1 246 184 20=1 21=20037 22=13 23=1 -23329=1,119.353905
Convolution              Conv_43                  1 1 184 249 0=512 1=3 4=1 5=1 6=2359296 20=1 21=93 22=15 24=2 25=1 -23329=1,11.831841
Eltwise                  Add_44                   2 1 249 181_splitncnn_0 187 0=1 20=1 21=8447 22=15 17=30745 18=13 -23329=1,11.448087
ReLU                     Relu_45                  1 1 187 188 20=1 21=16396 22=14 23=1 -23329=1,11.456571
Pooling                  GlobalAveragePool_46     1 1 188 190 0=1 4=1 20=1 21=25417 22=13 -23329=1,35.546024
InnerProduct             Gemm_48                  1 1 190 output0 0=1000 1=1 2=512000 20=1 21=63 22=15 24=2 25=1 -23329=1,12.159256
